Revit 2024 API
FabricSheetType Class
 Represents a fabric sheet type, used in the generation of fabric wires.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class FabricSheetType : ElementType
Visual Basic
Public Class FabricSheetType _
	Inherits ElementType
Visual C++
public ref class FabricSheetType : public ElementType
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Structure.FabricSheetType
See Also
FabricSheetType Members
Autodesk.Revit.DB.Structure Namespace